In [2]:
import numpy as np
import pandas as pd

In [6]:
column_names = ['user_id', 'item_id', 'rating', 'timestamp']

In [8]:
df = pd.read_csv('u.data', sep='\t', names=column_names)

In [7]:
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [3]:
movies_titles=pd.read_csv('Movie_Id_Titles')

In [4]:
movies_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [9]:
df=pd.merge(df,movies_titles)

In [10]:
df.head()

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

In [11]:
rating_mean=df.groupby('title')['rating'].mean()
rating_mean

title
'Til There Was You (1997)                2.333333
1-900 (1994)                             2.600000
101 Dalmatians (1996)                    2.908257
12 Angry Men (1957)                      4.344000
187 (1997)                               3.024390
                                           ...
Young Guns II (1990)                     2.772727
Young Poisoner's Handbook, The (1995)    3.341463
Zeus and Roxanne (1997)                  2.166667
unknown                                  3.444444
Á köldum klaka (Cold Fever) (1994)       3.000000
Name: rating, Length: 1664, dtype: float64

In [12]:

#if one person is rated then not good
rating_mean_dec=df.groupby('title')['rating'].mean().sort_values(ascending=False).head()

rating_mean_dec

title
They Made Me a Criminal (1939)                5.0
Marlene Dietrich: Shadow and Light (1996)     5.0
Saint of Fort Washington, The (1993)          5.0
Someone Else's America (1995)                 5.0
Star Kid (1997)                               5.0
Name: rating, dtype: float64

In [13]:
#By number of ratings
rating_count=df.groupby('title')['rating'].count()

rating_count_desc=df.groupby('title')['rating'].count().sort_values(ascending=False).head()

rating_count_desc

title
Star Wars (1977)             584
Contact (1997)               509
Fargo (1996)                 508
Return of the Jedi (1983)    507
Liar Liar (1997)             485
Name: rating, dtype: int64

In [15]:
rating = pd.DataFrame(rating_mean)

In [16]:
rating.head()

                             rating
title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390

In [17]:
rating['No of Ratings'] = pd.DataFrame(rating_count)

In [18]:
rating.head()

                             rating  No of Ratings
title
'Til There Was You (1997)  2.333333              9
1-900 (1994)               2.600000              5
101 Dalmatians (1996)      2.908257            109
12 Angry Men (1957)        4.344000            125
187 (1997)                 3.024390             41

In [19]:
#creating a movie rating matrix

movie_mat= df.pivot_table(index='user_id',columns='title',values='rating')

In [38]:
movie_mat.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [20]:
starwars_user_ratings = movie_mat['Star Wars (1977)']
starwars_user_ratings.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

In [21]:
simliar_star_war  = movie_mat.corrwith(starwars_user_ratings)

/Users/krishant/opt/anaconda3/lib/python3.8/site-packages/numpy/lib/function_base.py:2634: RuntimeWarning: Degrees of freedom <= 0 for slice
  c = cov(x, y, rowvar, dtype=dtype)
/Users/krishant/opt/anaconda3/lib/python3.8/site-packages/numpy/lib/function_base.py:2493: RuntimeWarning: divide by zero encountered in true_divide
  c *= np.true_divide(1, fact)

In [22]:
simliar_liar  = movie_mat.corrwith(liarliar_user_ratings)

NameError: name 'liarliar_user_ratings' is not defined

In [23]:
corr_starwars = pd.DataFrame(simliar_star_war,columns=['Correlation'])
corr_starwars.dropna(inplace=True)
corr_starwars.head()

                           Correlation
title
'Til There Was You (1997)     0.872872
1-900 (1994)                 -0.645497
101 Dalmatians (1996)         0.211132
12 Angry Men (1957)           0.184289
187 (1997)                    0.027398

In [24]:
#joining the no of rating per movie
corr_starwars = corr_starwars.join(rating['No of Ratings'])

In [26]:
corr_starwars.head()

                           Correlation  No of Ratings
title
'Til There Was You (1997)     0.872872              9
1-900 (1994)                 -0.645497              5
101 Dalmatians (1996)         0.211132            109
12 Angry Men (1957)           0.184289            125
187 (1997)                    0.027398             41

In [25]:
 #Refinning the movies for starwar
#which movie have more than 100 No. of rating
    
corr_starwars[corr_starwars['No of Ratings']>100].sort_values('Correlation',ascending=False).head()

                                                    Correlation  No of Ratings
title
Star Wars (1977)                                       1.000000            584
Empire Strikes Back, The (1980)                        0.748353            368
Return of the Jedi (1983)                              0.672556            507
Raiders of the Lost Ark (1981)                         0.536117            420
Austin Powers: International Man of Mystery (1997)     0.377433            130

In [ ]:
# starwars_user_ratings = movie_mat['Star Wars (1977)']
# simliar_star_war  = movie_mat.corrwith(starwars_user_ratings)
# corr_starwars = pd.DataFrame(simliar_star_war,columns=['Correlation'])
# corr_starwars = corr_starwars.join(rating['No of Ratings'])
# corr_starwars[corr_starwars['No of Ratings']>100].sort_values('Correlation',ascending=False).head()

In [26]:
# making function


def movie():
    key_user_rating = movie_mat['Star Wars (1977)']
    similar = movie_mat.corrwith(key_user_rating)
    corr_key = pd.DataFrame(similar,columns=['Correlation'])
    corr_key.dropna(inplace=True)
    corr_key = corr_key.join(rating['No of Ratings'])
    corr_key[corr_key['No of Ratings']>100].sort_values('Correlation',ascending=False).head()

# key = 'Star Wars (1977)'
# movie('Star Wars (1977)')
movie()

/Users/krishant/opt/anaconda3/lib/python3.8/site-packages/numpy/lib/function_base.py:2634: RuntimeWarning: Degrees of freedom <= 0 for slice
  c = cov(x, y, rowvar, dtype=dtype)
/Users/krishant/opt/anaconda3/lib/python3.8/site-packages/numpy/lib/function_base.py:2493: RuntimeWarning: divide by zero encountered in true_divide
  c *= np.true_divide(1, fact)

In [28]:
import numpy as np
import pandas as pd

column_names = ['user_id', 'item_id', 'rating', 'timestamp']
df = pd.read_csv('u.data', sep='\t', names=column_names)

movie_titles = pd.read_csv("Movie_Id_Titles")
df = pd.merge(df,movie_titles,on='item_id')

rating_mean=df.groupby('title')['rating'].mean()
rating_count=df.groupby('title')['rating'].count()

rating = pd.DataFrame(rating_mean)
rating['No of Ratings'] = pd.DataFrame(rating_count)

moviemat = df.pivot_table(index='user_id',columns='title',values='rating')


def movie():
    key_user_rating = movie_mat['Star Wars (1977)']
    similar = movie_mat.corrwith(key_user_rating)
    corr_key = pd.DataFrame(similar,columns=['Correlation'])
    corr_key.dropna(inplace=True)
    corr_key = corr_key.join(rating['No of Ratings'])
    corr_key[corr_key['No of Ratings']>100].sort_values('Correlation',ascending=False).head()
 
# key = 'Star Wars (1977)'
# movie('Star Wars (1977)')
movie()

TypeError: movie() takes 0 positional arguments but 1 was given